In [1]:
import os

In [2]:
os.listdir()

['.ipynb_checkpoints',
 'pandas_practice.ipynb',
 'supermarkets-commas.txt',
 'supermarkets-semi-colons.txt',
 'supermarkets.csv',
 'supermarkets.json',
 'supermarkets.txt',
 'supermarkets.xlsx',
 'Untitled.ipynb',
 'Untitled1.ipynb']

In [5]:
import pandas as pd

In [6]:
df1=pd.read_csv('supermarkets.csv')
df1

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [7]:
df2=pd.read_json('supermarkets.json')
df2

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [8]:
df3=pd.DataFrame([[3,4,5],[6,7,8]])
df3

   0  1  2
0  3  4  5
1  6  7  8

In [9]:
df3=pd.DataFrame([[3,4,5],[6,7,8]],columns=['Age','Price','Quantity'])
df3

   Age  Price  Quantity
0    3      4         5
1    6      7         8

In [13]:
df4=pd.DataFrame([{'Name':'Suma','Surname':'Chejarla'},{'Name':'Hima','Surname':'Chejarla'}],index=[1,2])
df4

   Name   Surname
1  Suma  Chejarla
2  Hima  Chejarla

In [14]:
df3.mean()

Age         4.5
Price       5.5
Quantity    6.5
dtype: float64

In [15]:
df3.mean().mean()

5.5

In [16]:
df3.Age.mean()

4.5

In [17]:
df3.Price.max()

7